grevaillot/svd_tools/headers/STM32G07x/exti.h
#pragma once 

/* --- EXTI: External interrupt/event controller -------------------- */

/** @defgroup exti_registers External interrupt/event
      controller Register
@{*/

/** EXTI_RTSR1 EXTI rising trigger selection register **/
#define EXTI_RTSR1			MMIO32(EXTI_BASE + 0x00)
/** EXTI_FTSR1 EXTI falling trigger selection register **/
#define EXTI_FTSR1			MMIO32(EXTI_BASE + 0x04)
/** EXTI_SWIER1 EXTI software interrupt event register **/
#define EXTI_SWIER1			MMIO32(EXTI_BASE + 0x08)
/** EXTI_RPR1 EXTI rising edge pending register **/
#define EXTI_RPR1			MMIO32(EXTI_BASE + 0x0c)
/** EXTI_FPR1 EXTI falling edge pending register **/
#define EXTI_FPR1			MMIO32(EXTI_BASE + 0x10)
/** EXTI_EXTICR1 EXTI external interrupt selection register **/
#define EXTI_EXTICR1			MMIO32(EXTI_BASE + 0x60)
/** EXTI_EXTICR2 EXTI external interrupt selection register **/
#define EXTI_EXTICR2			MMIO32(EXTI_BASE + 0x64)
/** EXTI_EXTICR3 EXTI external interrupt selection register **/
#define EXTI_EXTICR3			MMIO32(EXTI_BASE + 0x68)
/** EXTI_EXTICR4 EXTI external interrupt selection register **/
#define EXTI_EXTICR4			MMIO32(EXTI_BASE + 0x6c)
/** EXTI_IMR1 EXTI CPU wakeup with interrupt mask register **/
#define EXTI_IMR1			MMIO32(EXTI_BASE + 0x80)
/** EXTI_EMR1 EXTI CPU wakeup with event mask register **/
#define EXTI_EMR1			MMIO32(EXTI_BASE + 0x80)
/** EXTI_IMR2 EXTI CPU wakeup with interrupt mask register **/
#define EXTI_IMR2			MMIO32(EXTI_BASE + 0x90)
/** EXTI_EMR2 EXTI CPU wakeup with event mask register **/
#define EXTI_EMR2			MMIO32(EXTI_BASE + 0x94)
/** EXTI_HWCFGR7 Hardware configuration registers **/
#define EXTI_HWCFGR7			MMIO32(EXTI_BASE + 0x3d8)
/** EXTI_HWCFGR6 Hardware configuration registers **/
#define EXTI_HWCFGR6			MMIO32(EXTI_BASE + 0x3dc)
/** EXTI_HWCFGR5 Hardware configuration registers **/
#define EXTI_HWCFGR5			MMIO32(EXTI_BASE + 0x3e0)
/** EXTI_HWCFGR4 Hardware configuration registers **/
#define EXTI_HWCFGR4			MMIO32(EXTI_BASE + 0x3e4)
/** EXTI_HWCFGR3 Hardware configuration registers **/
#define EXTI_HWCFGR3			MMIO32(EXTI_BASE + 0x3e8)
/** EXTI_HWCFGR2 Hardware configuration registers **/
#define EXTI_HWCFGR2			MMIO32(EXTI_BASE + 0x3ec)
/** EXTI_HWCFGR1 Hardware configuration registers **/
#define EXTI_HWCFGR1			MMIO32(EXTI_BASE + 0x3f0)
/** EXTI_VERR AES version register **/
#define EXTI_VERR			MMIO32(EXTI_BASE + 0x3f4)
/** EXTI_IPIDR AES identification register **/
#define EXTI_IPIDR			MMIO32(EXTI_BASE + 0x3f8)
/** EXTI_SIDR AES size ID register **/
#define EXTI_SIDR			MMIO32(EXTI_BASE + 0x3fc)

/**@}*/


/** @defgroup exti_rtsr1 RTSR1 EXTI rising trigger selection register
@{*/

/** EXTI_RTSR1_TR18 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR18		(1 << 18)
/** EXTI_RTSR1_TR17 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR17		(1 << 17)
/** EXTI_RTSR1_TR16 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR16		(1 << 16)
/** EXTI_RTSR1_TR15 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR15		(1 << 15)
/** EXTI_RTSR1_TR14 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR14		(1 << 14)
/** EXTI_RTSR1_TR13 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR13		(1 << 13)
/** EXTI_RTSR1_TR12 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR12		(1 << 12)
/** EXTI_RTSR1_TR11 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR11		(1 << 11)
/** EXTI_RTSR1_TR10 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR10		(1 << 10)
/** EXTI_RTSR1_TR9 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR9		(1 << 9)
/** EXTI_RTSR1_TR8 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR8		(1 << 8)
/** EXTI_RTSR1_TR7 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR7		(1 << 7)
/** EXTI_RTSR1_TR6 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR6		(1 << 6)
/** EXTI_RTSR1_TR5 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR5		(1 << 5)
/** EXTI_RTSR1_TR4 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR4		(1 << 4)
/** EXTI_RTSR1_TR3 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR3		(1 << 3)
/** EXTI_RTSR1_TR2 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR2		(1 << 2)
/** EXTI_RTSR1_TR1 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR1		(1 << 1)
/** EXTI_RTSR1_TR0 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_RTSR1_TR0		(1 << 0)

/**@}*/

/** @defgroup exti_ftsr1 FTSR1 EXTI falling trigger selection register
@{*/

/** EXTI_FTSR1_TR18 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR18		(1 << 18)
/** EXTI_FTSR1_TR17 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR17		(1 << 17)
/** EXTI_FTSR1_TR16 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR16		(1 << 16)
/** EXTI_FTSR1_TR15 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR15		(1 << 15)
/** EXTI_FTSR1_TR14 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR14		(1 << 14)
/** EXTI_FTSR1_TR13 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR13		(1 << 13)
/** EXTI_FTSR1_TR12 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR12		(1 << 12)
/** EXTI_FTSR1_TR11 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR11		(1 << 11)
/** EXTI_FTSR1_TR10 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR10		(1 << 10)
/** EXTI_FTSR1_TR9 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR9		(1 << 9)
/** EXTI_FTSR1_TR8 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR8		(1 << 8)
/** EXTI_FTSR1_TR7 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR7		(1 << 7)
/** EXTI_FTSR1_TR6 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR6		(1 << 6)
/** EXTI_FTSR1_TR5 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR5		(1 << 5)
/** EXTI_FTSR1_TR4 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR4		(1 << 4)
/** EXTI_FTSR1_TR3 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR3		(1 << 3)
/** EXTI_FTSR1_TR2 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR2		(1 << 2)
/** EXTI_FTSR1_TR1 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR1		(1 << 1)
/** EXTI_FTSR1_TR0 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_FTSR1_TR0		(1 << 0)

/**@}*/

/** @defgroup exti_swier1 SWIER1 EXTI software interrupt event register
@{*/

/** EXTI_SWIER1_SWIER18 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER18		(1 << 18)
/** EXTI_SWIER1_SWIER17 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER17		(1 << 17)
/** EXTI_SWIER1_SWIER16 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER16		(1 << 16)
/** EXTI_SWIER1_SWIER15 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER15		(1 << 15)
/** EXTI_SWIER1_SWIER14 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER14		(1 << 14)
/** EXTI_SWIER1_SWIER13 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER13		(1 << 13)
/** EXTI_SWIER1_SWIER12 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER12		(1 << 12)
/** EXTI_SWIER1_SWIER11 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER11		(1 << 11)
/** EXTI_SWIER1_SWIER10 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER10		(1 << 10)
/** EXTI_SWIER1_SWIER9 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER9		(1 << 9)
/** EXTI_SWIER1_SWIER8 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER8		(1 << 8)
/** EXTI_SWIER1_SWIER7 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER7		(1 << 7)
/** EXTI_SWIER1_SWIER6 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER6		(1 << 6)
/** EXTI_SWIER1_SWIER5 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER5		(1 << 5)
/** EXTI_SWIER1_SWIER4 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER4		(1 << 4)
/** EXTI_SWIER1_SWIER3 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER3		(1 << 3)
/** EXTI_SWIER1_SWIER2 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER2		(1 << 2)
/** EXTI_SWIER1_SWIER1 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER1		(1 << 1)
/** EXTI_SWIER1_SWIER0 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_SWIER1_SWIER0		(1 << 0)

/**@}*/

/** @defgroup exti_rpr1 RPR1 EXTI rising edge pending register
@{*/

