grevaillot/svd_tools/headers/STM32G07x/exti.h
/** EXTI_RPR1_RPIF18 configurable event inputs x rising edge Pending bit. **/
#define EXTI_RPR1_RPIF18		(1 << 18)
/** EXTI_RPR1_RPIF17 configurable event inputs x rising edge Pending bit. **/
#define EXTI_RPR1_RPIF17		(1 << 17)
/** EXTI_RPR1_RPIF16 configurable event inputs x rising edge Pending bit. **/
#define EXTI_RPR1_RPIF16		(1 << 16)
/** EXTI_RPR1_RPIF15 configurable event inputs x rising edge Pending bit. **/
#define EXTI_RPR1_RPIF15		(1 << 15)
/** EXTI_RPR1_RPIF14 configurable event inputs x rising edge Pending bit. **/
#define EXTI_RPR1_RPIF14		(1 << 14)
/** EXTI_RPR1_RPIF13 configurable event inputs x rising edge Pending bit. **/
#define EXTI_RPR1_RPIF13		(1 << 13)
/** EXTI_RPR1_RPIF12 configurable event inputs x rising edge Pending bit. **/
#define EXTI_RPR1_RPIF12		(1 << 12)
/** EXTI_RPR1_RPIF11 configurable event inputs x rising edge Pending bit. **/
#define EXTI_RPR1_RPIF11		(1 << 11)
/** EXTI_RPR1_RPIF10 configurable event inputs x rising edge Pending bit. **/
#define EXTI_RPR1_RPIF10		(1 << 10)
/** EXTI_RPR1_RPIF9 configurable event inputs x rising edge Pending bit. **/
#define EXTI_RPR1_RPIF9		(1 << 9)
/** EXTI_RPR1_RPIF8 configurable event inputs x rising edge Pending bit. **/
#define EXTI_RPR1_RPIF8		(1 << 8)
/** EXTI_RPR1_RPIF7 configurable event inputs x rising edge Pending bit. **/
#define EXTI_RPR1_RPIF7		(1 << 7)
/** EXTI_RPR1_RPIF6 configurable event inputs x rising edge Pending bit. **/
#define EXTI_RPR1_RPIF6		(1 << 6)
/** EXTI_RPR1_RPIF5 configurable event inputs x rising edge Pending bit **/
#define EXTI_RPR1_RPIF5		(1 << 5)
/** EXTI_RPR1_RPIF4 configurable event inputs x rising edge Pending bit. **/
#define EXTI_RPR1_RPIF4		(1 << 4)
/** EXTI_RPR1_RPIF3 configurable event inputs x rising edge Pending bit. **/
#define EXTI_RPR1_RPIF3		(1 << 3)
/** EXTI_RPR1_RPIF2 configurable event inputs x rising edge Pending bit. **/
#define EXTI_RPR1_RPIF2		(1 << 2)
/** EXTI_RPR1_RPIF1 configurable event inputs x rising edge Pending bit. **/
#define EXTI_RPR1_RPIF1		(1 << 1)
/** EXTI_RPR1_RPIF0 configurable event inputs x rising edge Pending bit. **/
#define EXTI_RPR1_RPIF0		(1 << 0)

/**@}*/

/** @defgroup exti_fpr1 FPR1 EXTI falling edge pending register
@{*/

/** EXTI_FPR1_FPIF18 configurable event inputs x falling edge pending bit. **/
#define EXTI_FPR1_FPIF18		(1 << 18)
/** EXTI_FPR1_FPIF17 configurable event inputs x falling edge pending bit. **/
#define EXTI_FPR1_FPIF17		(1 << 17)
/** EXTI_FPR1_FPIF16 configurable event inputs x falling edge pending bit. **/
#define EXTI_FPR1_FPIF16		(1 << 16)
/** EXTI_FPR1_FPIF15 configurable event inputs x falling edge pending bit. **/
#define EXTI_FPR1_FPIF15		(1 << 15)
/** EXTI_FPR1_FPIF14 configurable event inputs x falling edge pending bit. **/
#define EXTI_FPR1_FPIF14		(1 << 14)
/** EXTI_FPR1_FPIF13 configurable event inputs x falling edge pending bit. **/
#define EXTI_FPR1_FPIF13		(1 << 13)
/** EXTI_FPR1_FPIF12 configurable event inputs x falling edge pending bit. **/
#define EXTI_FPR1_FPIF12		(1 << 12)
/** EXTI_FPR1_FPIF11 configurable event inputs x falling edge pending bit. **/
#define EXTI_FPR1_FPIF11		(1 << 11)
/** EXTI_FPR1_FPIF10 configurable event inputs x falling edge pending bit. **/
#define EXTI_FPR1_FPIF10		(1 << 10)
/** EXTI_FPR1_FPIF9 configurable event inputs x falling edge pending bit. **/
#define EXTI_FPR1_FPIF9		(1 << 9)
/** EXTI_FPR1_FPIF8 configurable event inputs x falling edge pending bit. **/
#define EXTI_FPR1_FPIF8		(1 << 8)
/** EXTI_FPR1_FPIF7 configurable event inputs x falling edge pending bit. **/
#define EXTI_FPR1_FPIF7		(1 << 7)
/** EXTI_FPR1_FPIF6 configurable event inputs x falling edge pending bit. **/
#define EXTI_FPR1_FPIF6		(1 << 6)
/** EXTI_FPR1_FPIF5 configurable event inputs x falling edge pending bit. **/
#define EXTI_FPR1_FPIF5		(1 << 5)
/** EXTI_FPR1_FPIF4 configurable event inputs x falling edge pending bit. **/
#define EXTI_FPR1_FPIF4		(1 << 4)
/** EXTI_FPR1_FPIF3 configurable event inputs x falling edge pending bit. **/
#define EXTI_FPR1_FPIF3		(1 << 3)
/** EXTI_FPR1_FPIF2 configurable event inputs x falling edge pending bit. **/
#define EXTI_FPR1_FPIF2		(1 << 2)
/** EXTI_FPR1_FPIF1 configurable event inputs x falling edge pending bit. **/
#define EXTI_FPR1_FPIF1		(1 << 1)
/** EXTI_FPR1_FPIF0 configurable event inputs x falling edge pending bit. **/
#define EXTI_FPR1_FPIF0		(1 << 0)

/**@}*/

/** @defgroup exti_exticr1 EXTICR1 EXTI external interrupt selection register
@{*/


#define EXTI_EXTICR1_EXTI24_31_SHIFT		24
#define EXTI_EXTICR1_EXTI24_31_MASK		0xff
/** @defgroup exti_exticr1_exti24_31 EXTI2431 GPIO port selection
@{*/
/**@}*/


#define EXTI_EXTICR1_EXTI16_23_SHIFT		16
#define EXTI_EXTICR1_EXTI16_23_MASK		0xff
/** @defgroup exti_exticr1_exti16_23 EXTI1623 GPIO port selection
@{*/
/**@}*/


#define EXTI_EXTICR1_EXTI8_15_SHIFT		8
#define EXTI_EXTICR1_EXTI8_15_MASK		0xff
/** @defgroup exti_exticr1_exti8_15 EXTI815 GPIO port selection
@{*/
/**@}*/


#define EXTI_EXTICR1_EXTI0_7_SHIFT		0
#define EXTI_EXTICR1_EXTI0_7_MASK		0xff
/** @defgroup exti_exticr1_exti0_7 EXTI07 GPIO port selection
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_exticr2 EXTICR2 EXTI external interrupt selection register
@{*/


#define EXTI_EXTICR2_EXTI24_31_SHIFT		24
#define EXTI_EXTICR2_EXTI24_31_MASK		0xff
/** @defgroup exti_exticr2_exti24_31 EXTI2431 GPIO port selection
@{*/
/**@}*/


#define EXTI_EXTICR2_EXTI16_23_SHIFT		16
#define EXTI_EXTICR2_EXTI16_23_MASK		0xff
/** @defgroup exti_exticr2_exti16_23 EXTI1623 GPIO port selection
@{*/
/**@}*/


#define EXTI_EXTICR2_EXTI8_15_SHIFT		8
#define EXTI_EXTICR2_EXTI8_15_MASK		0xff
/** @defgroup exti_exticr2_exti8_15 EXTI815 GPIO port selection
@{*/
/**@}*/


#define EXTI_EXTICR2_EXTI0_7_SHIFT		0
#define EXTI_EXTICR2_EXTI0_7_MASK		0xff
/** @defgroup exti_exticr2_exti0_7 EXTI07 GPIO port selection
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_exticr3 EXTICR3 EXTI external interrupt selection register
@{*/


#define EXTI_EXTICR3_EXTI24_31_SHIFT		24
#define EXTI_EXTICR3_EXTI24_31_MASK		0xff
/** @defgroup exti_exticr3_exti24_31 EXTI2431 GPIO port selection
@{*/
/**@}*/


#define EXTI_EXTICR3_EXTI16_23_SHIFT		16
#define EXTI_EXTICR3_EXTI16_23_MASK		0xff
/** @defgroup exti_exticr3_exti16_23 EXTI1623 GPIO port selection
@{*/
/**@}*/


#define EXTI_EXTICR3_EXTI8_15_SHIFT		8
#define EXTI_EXTICR3_EXTI8_15_MASK		0xff
/** @defgroup exti_exticr3_exti8_15 EXTI815 GPIO port selection
@{*/
/**@}*/


