grevaillot/svd_tools/headers/STM32G07x/exti.h
#define EXTI_EXTICR3_EXTI0_7_SHIFT		0
#define EXTI_EXTICR3_EXTI0_7_MASK		0xff
/** @defgroup exti_exticr3_exti0_7 EXTI07 GPIO port selection
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_exticr4 EXTICR4 EXTI external interrupt selection register
@{*/


#define EXTI_EXTICR4_EXTI24_31_SHIFT		24
#define EXTI_EXTICR4_EXTI24_31_MASK		0xff
/** @defgroup exti_exticr4_exti24_31 EXTI2431 GPIO port selection
@{*/
/**@}*/


#define EXTI_EXTICR4_EXTI16_23_SHIFT		16
#define EXTI_EXTICR4_EXTI16_23_MASK		0xff
/** @defgroup exti_exticr4_exti16_23 EXTI1623 GPIO port selection
@{*/
/**@}*/


#define EXTI_EXTICR4_EXTI8_15_SHIFT		8
#define EXTI_EXTICR4_EXTI8_15_MASK		0xff
/** @defgroup exti_exticr4_exti8_15 EXTI815 GPIO port selection
@{*/
/**@}*/


#define EXTI_EXTICR4_EXTI0_7_SHIFT		0
#define EXTI_EXTICR4_EXTI0_7_MASK		0xff
/** @defgroup exti_exticr4_exti0_7 EXTI07 GPIO port selection
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_imr1 IMR1 EXTI CPU wakeup with interrupt mask register
@{*/

/** EXTI_IMR1_IM31 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM31		(1 << 31)
/** EXTI_IMR1_IM30 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM30		(1 << 30)
/** EXTI_IMR1_IM29 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM29		(1 << 29)
/** EXTI_IMR1_IM28 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM28		(1 << 28)
/** EXTI_IMR1_IM27 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM27		(1 << 27)
/** EXTI_IMR1_IM26 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM26		(1 << 26)
/** EXTI_IMR1_IM25 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM25		(1 << 25)
/** EXTI_IMR1_IM24 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM24		(1 << 24)
/** EXTI_IMR1_IM23 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM23		(1 << 23)
/** EXTI_IMR1_IM22 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM22		(1 << 22)
/** EXTI_IMR1_IM21 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM21		(1 << 21)
/** EXTI_IMR1_IM20 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM20		(1 << 20)
/** EXTI_IMR1_IM19 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM19		(1 << 19)
/** EXTI_IMR1_IM18 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM18		(1 << 18)
/** EXTI_IMR1_IM17 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM17		(1 << 17)
/** EXTI_IMR1_IM16 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM16		(1 << 16)
/** EXTI_IMR1_IM15 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM15		(1 << 15)
/** EXTI_IMR1_IM14 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM14		(1 << 14)
/** EXTI_IMR1_IM13 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM13		(1 << 13)
/** EXTI_IMR1_IM12 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM12		(1 << 12)
/** EXTI_IMR1_IM11 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM11		(1 << 11)
/** EXTI_IMR1_IM10 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM10		(1 << 10)
/** EXTI_IMR1_IM9 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM9		(1 << 9)
/** EXTI_IMR1_IM8 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM8		(1 << 8)
/** EXTI_IMR1_IM7 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM7		(1 << 7)
/** EXTI_IMR1_IM6 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM6		(1 << 6)
/** EXTI_IMR1_IM5 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM5		(1 << 5)
/** EXTI_IMR1_IM4 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM4		(1 << 4)
/** EXTI_IMR1_IM3 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM3		(1 << 3)
/** EXTI_IMR1_IM2 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM2		(1 << 2)
/** EXTI_IMR1_IM1 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM1		(1 << 1)
/** EXTI_IMR1_IM0 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR1_IM0		(1 << 0)

/**@}*/

/** @defgroup exti_emr1 EMR1 EXTI CPU wakeup with event mask register
@{*/

/** EXTI_EMR1_EM31 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM31		(1 << 31)
/** EXTI_EMR1_EM30 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM30		(1 << 30)
/** EXTI_EMR1_EM29 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM29		(1 << 29)
/** EXTI_EMR1_EM28 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM28		(1 << 28)
/** EXTI_EMR1_EM27 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM27		(1 << 27)
/** EXTI_EMR1_EM26 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM26		(1 << 26)
/** EXTI_EMR1_EM25 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM25		(1 << 25)
/** EXTI_EMR1_EM23 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM23		(1 << 23)
/** EXTI_EMR1_EM21 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM21		(1 << 21)
/** EXTI_EMR1_EM19 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM19		(1 << 19)
/** EXTI_EMR1_EM18 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM18		(1 << 18)
/** EXTI_EMR1_EM17 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM17		(1 << 17)
/** EXTI_EMR1_EM16 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM16		(1 << 16)
/** EXTI_EMR1_EM15 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM15		(1 << 15)
/** EXTI_EMR1_EM14 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM14		(1 << 14)
/** EXTI_EMR1_EM13 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM13		(1 << 13)
/** EXTI_EMR1_EM12 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM12		(1 << 12)
/** EXTI_EMR1_EM11 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM11		(1 << 11)
/** EXTI_EMR1_EM10 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM10		(1 << 10)
/** EXTI_EMR1_EM9 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM9		(1 << 9)
/** EXTI_EMR1_EM8 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM8		(1 << 8)
/** EXTI_EMR1_EM7 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM7		(1 << 7)
/** EXTI_EMR1_EM6 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM6		(1 << 6)
/** EXTI_EMR1_EM5 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM5		(1 << 5)
/** EXTI_EMR1_EM4 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM4		(1 << 4)
/** EXTI_EMR1_EM3 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM3		(1 << 3)
/** EXTI_EMR1_EM2 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM2		(1 << 2)
/** EXTI_EMR1_EM1 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM1		(1 << 1)
/** EXTI_EMR1_EM0 CPU wakeup with event mask on event input **/
#define EXTI_EMR1_EM0		(1 << 0)

/**@}*/

/** @defgroup exti_imr2 IMR2 EXTI CPU wakeup with interrupt mask register
@{*/

/** EXTI_IMR2_IM33 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR2_IM33		(1 << 1)
/** EXTI_IMR2_IM32 CPU wakeup with interrupt mask on event input **/
#define EXTI_IMR2_IM32		(1 << 0)

/**@}*/

