grevaillot/svd_tools/headers/STM32G07x/exti.h
/** @defgroup exti_emr2 EMR2 EXTI CPU wakeup with event mask register
@{*/

/** EXTI_EMR2_EM33 CPU wakeup with event mask on event input **/
#define EXTI_EMR2_EM33		(1 << 1)
/** EXTI_EMR2_EM32 CPU wakeup with event mask on event input **/
#define EXTI_EMR2_EM32		(1 << 0)

/**@}*/

/** @defgroup exti_hwcfgr7 HWCFGR7 Hardware configuration registers
@{*/


#define EXTI_HWCFGR7_CPUEVENT_SHIFT		0
#define EXTI_HWCFGR7_CPUEVENT_MASK		0xffffffff
/** @defgroup exti_hwcfgr7_cpuevent CPUEVENT HW configuration CPU event generation
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_hwcfgr6 HWCFGR6 Hardware configuration registers
@{*/


#define EXTI_HWCFGR6_CPUEVENT_SHIFT		0
#define EXTI_HWCFGR6_CPUEVENT_MASK		0xffffffff
/** @defgroup exti_hwcfgr6_cpuevent CPUEVENT HW configuration CPU event generation
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_hwcfgr5 HWCFGR5 Hardware configuration registers
@{*/


#define EXTI_HWCFGR5_CPUEVENT_SHIFT		0
#define EXTI_HWCFGR5_CPUEVENT_MASK		0xffffffff
/** @defgroup exti_hwcfgr5_cpuevent CPUEVENT HW configuration CPU event generation
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_hwcfgr4 HWCFGR4 Hardware configuration registers
@{*/


#define EXTI_HWCFGR4_EVENT_TRG_SHIFT		0
#define EXTI_HWCFGR4_EVENT_TRG_MASK		0xffffffff
/** @defgroup exti_hwcfgr4_event_trg EVENTTRG HW configuration event trigger type
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_hwcfgr3 HWCFGR3 Hardware configuration registers
@{*/


#define EXTI_HWCFGR3_EVENT_TRG_SHIFT		0
#define EXTI_HWCFGR3_EVENT_TRG_MASK		0xffffffff
/** @defgroup exti_hwcfgr3_event_trg EVENTTRG HW configuration event trigger type
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_hwcfgr2 HWCFGR2 Hardware configuration registers
@{*/


#define EXTI_HWCFGR2_EVENT_TRG_SHIFT		0
#define EXTI_HWCFGR2_EVENT_TRG_MASK		0xffffffff
/** @defgroup exti_hwcfgr2_event_trg EVENTTRG HW configuration event trigger type
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_hwcfgr1 HWCFGR1 Hardware configuration registers
@{*/


#define EXTI_HWCFGR1_NBIOPORT_SHIFT		16
#define EXTI_HWCFGR1_NBIOPORT_MASK		0xff
/** @defgroup exti_hwcfgr1_nbioport NBIOPORT HW configuration of number of IO ports
@{*/
/**@}*/


#define EXTI_HWCFGR1_CPUEVTEN_SHIFT		12
#define EXTI_HWCFGR1_CPUEVTEN_MASK		0x0f
/** @defgroup exti_hwcfgr1_cpuevten CPUEVTEN HW configuration of CPU event output enable
@{*/
/**@}*/


#define EXTI_HWCFGR1_NBCPUS_SHIFT		8
#define EXTI_HWCFGR1_NBCPUS_MASK		0x0f
/** @defgroup exti_hwcfgr1_nbcpus NBCPUS configuration number of CPUs
@{*/
/**@}*/


#define EXTI_HWCFGR1_NBEVENTS_SHIFT		0
#define EXTI_HWCFGR1_NBEVENTS_MASK		0xff
/** @defgroup exti_hwcfgr1_nbevents NBEVENTS configuration number of event
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_verr VERR AES version register
@{*/


#define EXTI_VERR_MAJREV_SHIFT		4
#define EXTI_VERR_MAJREV_MASK		0x0f
/** @defgroup exti_verr_majrev MAJREV Major revision
@{*/
/**@}*/


#define EXTI_VERR_MINREV_SHIFT		0
#define EXTI_VERR_MINREV_MASK		0x0f
/** @defgroup exti_verr_minrev MINREV Minor revision
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_ipidr IPIDR AES identification register
@{*/


#define EXTI_IPIDR_ID_SHIFT		0
#define EXTI_IPIDR_ID_MASK		0xffffffff
/** @defgroup exti_ipidr_id ID Identification code
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_sidr SIDR AES size ID register
@{*/


#define EXTI_SIDR_ID_SHIFT		0
#define EXTI_SIDR_ID_MASK		0xffffffff
/** @defgroup exti_sidr_id ID Size Identification code
@{*/
/**@}*/


/**@}*/
